cmsis-svd/cmsis-svd/data/NXP/LPC804.svd
        <register>
          <name>PINASSIGNFIXED0</name>
          <description>Pin assign to fixed bits register 0. Pin assign to fixed bits register 0. Assign movable functions PLU_INPUT0 to PLU_INPUT5 and PLU_OUT0 to PLU_INPUT7.</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFF</resetValue>
          <resetMask>0xFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLU_INPUT0</name>
              <description>PLU_INPUT0 function assignment.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Assign_PIO0_00</name>
                  <description>Assign to PIO0_00.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_08</name>
                  <description>Assign to PIO0_08.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_17</name>
                  <description>Assign to PIO0_17.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLU_INPUT1</name>
              <description>PLU_INPUT1 function assignment</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Assign_PIO0_01</name>
                  <description>Assign to PIO0_01.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_09</name>
                  <description>Assign to PIO0_09.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_18</name>
                  <description>Assign to PIO0_18.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLU_INPUT2</name>
              <description>PLU_INPUT2 function assignment.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Assign_PIO0_02</name>
                  <description>Assign to PIO0_02.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_10</name>
                  <description>Assign to PIO0_10.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_19</name>
                  <description>Assign to PIO0_19.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLU_INPUT3</name>
              <description>PLU_INPUT3 function assignment.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Assign_PIO0_03</name>
                  <description>Assign to PIO0_03.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_11</name>
                  <description>Assign to PIO0_11.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_20</name>
                  <description>Assign to PIO0_20.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLU_INPUT4</name>
              <description>PLU_INPUT4 function assignment.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Assign_PIO0_04</name>
                  <description>Assign to PIO0_04.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_12</name>
                  <description>Assign to PIO0_12.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_21</name>
                  <description>Assign to PIO0_21.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLU_INPUT5</name>
              <description>PLU_INPUT5 function assignment.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Assign_PIO0_05</name>
                  <description>Assign to PIO0_05.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_13</name>
                  <description>Assign to PIO0_13.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_22</name>
                  <description>Assign to PIO0_22.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLU_OUT0</name>
              <description>PLU_OUT0 function assignment.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Assign_PIO0_07</name>
                  <description>Assign to PIO0_07.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_14</name>
                  <description>Assign to PIO0_14.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_23</name>
                  <description>Assign to PIO0_23.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLU_OUT1</name>
              <description>PLU_OUT1 function assignment.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Assign_PIO0_08</name>
                  <description>Assign to PIO0_08.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_15</name>
                  <description>Assign to PIO0_15.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_24</name>
                  <description>Assign to PIO0_24.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLU_OUT2</name>
              <description>PLU_OUT2 function assignment.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Assign_PIO0_09</name>
                  <description>Assign to PIO0_09.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_16</name>
                  <description>Assign to PIO0_16.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_25</name>
                  <description>Assign to PIO0_25.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLU_OUT3</name>
              <description>PLU_OUT3 function assignment.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Assign_PIO0_10</name>
                  <description>Assign to PIO0_10.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_17</name>
                  <description>Assign to PIO0_17.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_26</name>
                  <description>Assign to PIO0_26.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLU_OUT4</name>
              <description>PLU_OUT4 function assignment.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Assign_PIO0_11</name>
                  <description>Assign to PIO0_11.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_18</name>
                  <description>Assign to PIO0_18.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_27</name>
                  <description>Assign to PIO0_27.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLU_OUT5</name>
              <description>PLU_OUT5 function assignment.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Assign_PIO0_12</name>
                  <description>Assign to PIO0_12.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_19</name>
                  <description>Assign to PIO0_19.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_28</name>
                  <description>Assign to PIO0_28.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLU_OUT6</name>
              <description>PLU_OUT6 function assignment.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Assign_PIO0_13</name>
                  <description>Assign to PIO0_13.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_20</name>
                  <description>Assign to PIO0_20.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_29</name>
                  <description>Assign to PIO0_29.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLU_OUT7</name>
              <description>PLU_OUT7 function assignment.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Assign_PIO0_14</name>
                  <description>Assign to PIO0_14.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_21</name>
                  <description>Assign to PIO0_21.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Assign_PIO0_30</name>
                  <description>Assign to PIO0_30.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
