cmsis-svd/cmsis-svd/data/NXP/LPC804.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PLU</name>
      <description>LPC80X Programmable Logic Unit (PLU)</description>
      <groupName>PLU</groupName>
      <baseAddress>0x40028000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xC20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>26</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>LUT[%s]</name>
          <description>no description available</description>
          <addressOffset>0</addressOffset>
          <register>
            <dim>5</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>0,1,2,3,4</dimIndex>
            <name>LUT_INP_MUX%s</name>
            <description>LUT0 input 0 MUX</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>LUTn_INPx</name>
                <description>Selects the input source to be connected to LUT0 input0. For each LUT, the slot associated with the output from LUTn itself is tied low.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>plu_inputs0</name>
                    <description>The PLU primary inputs 0.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>plu_inputs1</name>
                    <description>The PLU primary inputs 1.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>plu_inputs2</name>
                    <description>The PLU primary inputs 2.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>plu_inputs3</name>
                    <description>The PLU primary inputs 3.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>plu_inputs4</name>
                    <description>The PLU primary inputs 4.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>plu_inputs5</name>
                    <description>The PLU primary inputs 5.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs0</name>
                    <description>The output of LUT0.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs1</name>
                    <description>The output of LUT1.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs2</name>
                    <description>The output of LUT2.</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs3</name>
                    <description>The output of LUT3.</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs4</name>
                    <description>The output of LUT4.</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs5</name>
                    <description>The output of LUT5.</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs6</name>
                    <description>The output of LUT6.</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs7</name>
                    <description>The output of LUT7.</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs8</name>
                    <description>The output of LUT8.</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs9</name>
                    <description>The output of LUT9.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs10</name>
                    <description>The output of LUT10.</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs11</name>
                    <description>The output of LUT11.</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs12</name>
                    <description>The output of LUT12.</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs13</name>
                    <description>The output of LUT13.</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs14</name>
                    <description>The output of LUT14.</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs15</name>
                    <description>The output of LUT15.</description>
                    <value>0x15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs16</name>
                    <description>The output of LUT16.</description>
                    <value>0x16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs17</name>
                    <description>The output of LUT17.</description>
                    <value>0x17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs18</name>
                    <description>The output of LUT18.</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs19</name>
                    <description>The output of LUT19.</description>
                    <value>0x19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs20</name>
                    <description>The output of LUT20.</description>
                    <value>0x1A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs21</name>
                    <description>The output of LUT21.</description>
                    <value>0x1B</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs22</name>
                    <description>The output of LUT22.</description>
                    <value>0x1C</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs23</name>
                    <description>The output of LUT23.</description>
                    <value>0x1D</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs24</name>
                    <description>The output of LUT24.</description>
                    <value>0x1E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>lut_outputs25</name>
                    <description>The output of LUT25.</description>
                    <value>0x1F</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>state0</name>
                    <description>state(0).</description>
                    <value>0x20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>state1</name>
                    <description>state(1).</description>
                    <value>0x21</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>state2</name>
                    <description>state(2).</description>
                    <value>0x22</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>state3</name>
                    <description>state(3).</description>
                    <value>0x23</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>26</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>LUT_TRUTH[%s]</name>
          <description>Specifies the Truth Table contents for LUT0</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LUTn_TRUTH</name>
              <description>Specifies the Truth Table contents for LUT0..</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTPUTS</name>
          <description>Provides the current state of the 8 designated PLU Outputs.</description>
          <addressOffset>0x900</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUTPUT_STATE</name>
              <description>Provides the current state of the 8 designated PLU Outputs..</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>OUTPUT_MUX[%s]</name>
          <description>Selects the source to be connected to PLU Output 0</description>
          <addressOffset>0xC00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUTPUTn</name>
              <description>Selects the source to be connected to PLU Output 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>plu_output0</name>
                  <description>The PLU output 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output1</name>
                  <description>The PLU output 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output2</name>
                  <description>The PLU output 2.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output3</name>
                  <description>The PLU output 3.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output4</name>
                  <description>The PLU output 4.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output5</name>
                  <description>The PLU output 5.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output6</name>
                  <description>The PLU output 6.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output7</name>
                  <description>The PLU output 7.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output8</name>
                  <description>The PLU output 8.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output9</name>
                  <description>The PLU output 9.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output10</name>
                  <description>The PLU output 10.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output11</name>
                  <description>The PLU output 11.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output12</name>
                  <description>The PLU output 12.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output13</name>
                  <description>The PLU output 13.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output14</name>
                  <description>The PLU output 14.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output15</name>
                  <description>The PLU output 15.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output16</name>
                  <description>The PLU output 16.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output17</name>
                  <description>The PLU output 17.</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output18</name>
                  <description>The PLU output 18.</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output19</name>
                  <description>The PLU output 19.</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output20</name>
                  <description>The PLU output 20.</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output21</name>
                  <description>The PLU output 21.</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output22</name>
                  <description>The PLU output 22.</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output23</name>
                  <description>The PLU output 23.</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output24</name>
                  <description>The PLU output 24.</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>plu_output25</name>
                  <description>The PLU output 25.</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>state0</name>
                  <description>state(0).</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>state1</name>
                  <description>state(1).</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>state2</name>
                  <description>state(2).</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>state3</name>
                  <description>state(3).</description>
                  <value>0x1D</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
